// 6、document.parentNode 和 document.parentnode 的区别？（腾讯）
// document.parentNode => null
// document.parentnode => undefined


// 7、怎么规避多人开发函数重名的问题？（百度搜索）
// 三大种: 
// 单例: 把实现当前模块的方法和属性放在同一个命名空间下
// 模块化思想  
// (AMD  CMD  CommonJS)


// 8、JavaScript如何实现面向对象中的继承？ （百度移动）
// 原型继承  call继承  混合继承 冒充对象继承  寄生组合式继承  class基于extends继承(ES6)  周氏继承法
// 9、你理解的闭包作用是什么，优缺点？（乐视）
// 开放性的题, 需要自己整理

// 趣味题（乐视） 
// 有这样一个村庄，村里的每一个丈夫都背着妻子偷情，村里的每个妻子都知道除了自己丈夫以外的男人偷情，村里有一个规定，如果妻子知道自己的丈夫偷情必须当天处决。有一天村里的女头领说村里有一个丈夫偷情，接下来会发生什么？
// 随性题自己怎么认为怎么答

