/*
    类库, 插件, UI组件, 框架
        1. 类库: JQ/ZEPTO... 提供一些真实项目中常用的方法, 任何项目都可以把类库导入进来, 调取里面的方法实现自己需要的业务逻辑(JQ是PC端考虑兼容性的, ZEPTO是手机端不考虑兼容的)
        2. 插件: 具备一定的业务功能, 例如, 我们可以封装轮播图插件, 选项卡插件, 模态框插件等(插件规定了当前这个功能的样式解构, 把实现功能的js进行封装, 以后想实现这个功能直接导入插件即可) swiper\iscroll\jquery-dialog\jquery-drag\jquery-datepicker\Echarts...
        3. UI组件: 把结构, css, js全部都封装好了, 我们想实现一个功能直接导入进来即可(偶尔需要我们修改一下) bootstrap...
        4. 框架: 具备一定的编程思想, 要求我们按照框架的思想开发, 一般框架中提供了常用的类库方法, 提供了强大的功能插件, 有的也提供了强大的UI组件.  React(React native)\Vue\Angular\Backone\Sea.js\Require.js...


    jQuery(JQ)非常优秀的"类库"
        基于原生js封装的一个类库,提供了很多的方法, 而且这些方法是兼容所有浏览器.
        JQ版本:
            v1 最常用的版本 1.8.3  1.9.3  1.11.3最常用的版本
            v2 为移动端做贡献, 不支持兼容性
            v3 vue\react崛起的时代, 用的人不多了. 和v1版本差不多
 */








